In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dataset = pd.read_csv('sample_data.csv')
dataset.head()

      Name   Age  Gender         City   Salary
0    Alice  29.0  Female     New York  70000.0
1      Bob   NaN    Male  Los Angeles  80000.0
2  Charlie  25.0     NaN      Chicago      NaN
3    David  40.0    Male          NaN  95000.0
4      Eva  30.0  Female      Phoenix  85000.0

In [3]:
dataset.isnull().sum()

Name      0
Age       2
Gender    1
City      2
Salary    2
dtype: int64

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     5 non-null      float64
 2   Gender  6 non-null      object
 3   City    5 non-null      object
 4   Salary  5 non-null      float64
dtypes: float64(2), object(3)
memory usage: 412.0+ bytes

In [5]:
dataset.select_dtypes(include='float64').columns

Index(['Age', 'Salary'], dtype='object')

In [ ]:
from sklearn.impute import SimpleImputer
si = SimpleImputer(strategy="mean")
ar = si.fit_transform(dataset[['Age', 'Salary']])               #fill data with mean
new_dataset = pd.DataFrame(ar , columns=dataset.select_dtypes(include='float64').columns)
new_dataset.isnull().sum()

Age       0
Salary    0
dtype: int64

In [8]:
new_dataset

    Age   Salary
0  29.0  70000.0
1  30.4  80000.0
2  25.0  80400.0
3  40.0  95000.0
4  30.0  85000.0
5  28.0  80400.0
6  30.4  72000.0

In [9]:
new_dataset['Salary'].mean()

np.float64(80400.0)